import React from "react";
import styles from "./AboutUs.module.css";
import logo from "../../assets/efbdb997-a175-4f68-b020-25fa0c564224.png"
import { Link } from "react-router-dom";

const AboutUs = () => {
  return (
    <div className={styles.page}>
      {/* Основной текстовый блок */}
      <div className={styles.container}>
        <h2 className={styles.title}>
          Устал от бесконечного скролла в общих чатах, где невозможно никого нормально узнать? Мы тоже.
        </h2>
        <p className={styles.text}>
          Поэтому мы, такие же первокурсники-разработчики, сделали <strong>UniHub</strong> — уютную площадку для знакомств в рамках нашего университета. Здесь можно:
        </p>
        <ul className={styles.list}>
          <li className={styles.listItem}>Найти соседа в общагу или партнёра по спортзалу 💪</li>
          <li className={styles.listItem}>Обсудить сложную лабу с тем, кто её уже сдал 🧠</li>
          <li className={styles.listItem}>Создать или найти компанию для похода на концерт или в бар 🎉</li>
          <li className={styles.listItem}>И да, конечно, познакомиться с кем-то особенным ❤️</li>
        </ul>
        <p className={styles.text}>
          Без лишней сложности. Без фейков. Только свой университетский круг. Регистрируйся и начни общаться по-настоящему!
        </p>
      </div>
      <div className={styles.partnerSection}>
        <h3 className={styles.partnerTitle}>Наш партнёр</h3>
        <div className={styles.partnerCard}>
          <Link to='https://t.me/coach_by_knitu_bot'>
          <img
            src={logo}
            alt="Partner Logo"
            className={styles.partnerLogo}
          />
          </Link>
          <p className={styles.partnerText}>
            Мы рады сотрудничать с <strong>Momentum Bot</strong> — нашим партнёром в сфере спорта для студентов.<br /><br />
            Momentum Bot — это твой цифровой тренер в зале🦾
            Он существует для того, чтобы твое движение в зале никогда не теряло силу и цель. Он помогает поймать волну, на которой вес становится легче, а повторения — увереннее, создавая цепную реакцию успеха.
            Между «надо» и «хочу» есть щель, между усилием и результатом — твой импульс⚡️
          </p>
        </div>
      </div>
    </div>
  );
};

export default AboutUs;
